/*2152402 软件 段婷婷*/
#include <iostream>
using namespace std;

/* ----具体要求----
   1、不允许添加其它头文件
   2、不允许定义全局变量、静态局部变量
   3、不允许添加其它函数
   4、整个程序不允许出现任何形式的循环
   --------------------------------------------------------------------- */

   /***************************************************************************
	 函数名称：
	 功    能：将整数n分解后输出
	 输入参数：
	 返 回 值：
	 说    明：1、函数名、形参、返回类型均不准动
			   2、不允许使用64位整数
   ***************************************************************************/
void convert(int n)
{
	if (n / 10 != 0)
		convert(n / 10);
	if (n / 10 == 0 && n < 0)
		cout << char('-') << char(' ');
	cout << char(abs(n % 10) + '0') << char(' ');
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：main函数不准动
***************************************************************************/
int main()
{
	int n;
	cout << "请输入一个整数" << endl;
	cin >> n;

	convert(n);
	cout << endl;

	return 0;
}
/*
* 本题输入在输入2147483648时不处理输入错误情况下是没问题的（为什么？） 
* 因为用cin输入int型数据，若输入数据超过int型上限，则实际相当于输入2147483647
*/