/*2152402 软件 段婷婷*/
#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

/* ----具体要求----
   1、不允许添加其它头文件
   2、不允许定义全局变量、静态局部变量
   3、不允许添加其它函数
   4、整个程序不允许出现任何形式的循环
   --------------------------------------------------------------------- */

   /***************************************************************************
	 函数名称：
	 功    能：将整数n分解后逆序输出
	 输入参数：
	 返 回 值：
	 说    明：1、函数名、形参、返回类型均不准动
			   2、不允许使用64位整数
   ***************************************************************************/
void convert(int n)
{
	if (n == 0)
		return;
	printf("%c ", (char)(abs(n % 10) + '0'));
	if (n / 10 == 0 && n < 0)
		printf("%c ", '-');
	convert(n / 10);
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：main函数不准动
***************************************************************************/
int main()
{
	int n;
	printf("请输入一个整数\n");
	scanf("%d", &n);

	convert(n);
	printf("\n");

	return 0;
}
/*
* 本题输入2147483648时在不处理输入错误情况下是没问题的且与 C++不同（为什么？）
* 在用scanf输入int型数据时，若输入值大于int上限，则实际输入的值为原值的二进制表示取低32位对应的int型数据。
* （这一点与C++的cin不同）
*/